/*Да се напише програма за работа со квадратни матрици (најмногу 100х100). Од
тастатура се чита димензијата на квадратната матрица и потоа се внесуваат елементите на
матрицата. Програмата треба да провери дали матрицата го задоволува следниов услов:
секој елемент од споредната дијагонала да биде еднаков на збирот од елементите лево (во
истата редица) од тој елемент. На екран да се испечати порака дали матрицата го
задоволува условот. 
1 2 3 
4 5 6 
7 8 9 */
#include <stdio.h>
int main ()
{
    int n, m, j, i, sum, prov=1;
    printf("vnesi gi dimenziite na matricata: ");
    scanf("%d %d", &n, &m);
    int a[n][m];
    printf("vnesi gi elementite na matricata: ");
    for (i=0; i<n; i++)
    {
        for ( j=0; j<m; j++)
        scanf("%d", &a[i][j]);
    }
    for ( i=0; i<n-1; i++)
    {
        sum=0;
        for (j=0; (i+j)<n-1; j++)
        {
            sum+=a[i][j];
        }
        if (sum!=a[i][j])
        {
            prov=0;
            break;
        }
    }
    if (prov)
    printf("da");
    else
    printf("ne");
    return 0;
}