/*Да се напише рекурзивна функција која за цел
број, кој се пренесува како аргумент, ќе
проверува дали секоја следна цифра во бројот
е исклучиво помала од претходната. Доколку е
исполнет условот функцијата да враќа 1, во
спротивно функцијата да враќа 0.
 Пример: За бројот 23457, 7 > 5, 5 > 4, 4 > 3, 3 >
2, па условот е задоволен. Во овој случај
функцијата ќе враќа 1. За бројот 43557,
функцијата ќе враќа 0.*/
#include <stdio.h>
int funkcija(int a);
int main ()
{
    int n;
    printf("vnesi broj ");
    scanf("%d", &n);
    return 0;
}
int funkcija (int a)
{
    // ne sum doreshila
}