/*Да се напише програма со употреба на циклуси, која што на
екран ќе ги испечати сите пет-цифрени броеви кај кои збирот
на четирите најзначајни цифри е еднаков со најмалку
значајната цифра на истиот тој број. Дополнително да се
испечатат колку такви броеви постојат.
 Пр. 21418= (2+1+4+1) го исполнува условот, бидејки збирот на
најмногу значајните броеви е 8, што е исто со најмалку
значајната цифра 8 во бројот.
 Пр. 21217= (2+1+2+1) НЕ го исполнува условот, бидејки збирот
на најмногу значајните броеви е 6, што НЕ е исто со најмалку
значајната цифра 7 во бројот.*/
#include <stdio.h>
int main ()
{
    int i, n=0;
    for (i=10000; i<99999; i++)
    {
        int b=i, s=0;
            n=b%10;
            b/=10;
        while ( b!=0 )
        {
            s+=b%10;
            b/=10;
        }
        if ( n == s )
        printf("%d\n", i);
    }
    return 0;
}