/*Да се напише програма во која се внесува непознат број
на броеви со парен број на цифри од тастатура.
Програмата треба да го подели бројот на два дела.
Првиот дел го сочинуваат најмногу значајните цифри, а
вториот дел го сочинуваат најмалку значајните цифри од
внесениот број. На двата новоформирани броеви треба
да им се помножат цифрите помеѓу себе. Конечниот
резултат е збирот од производот на двата дела. Да се
испечати конечниот резултат. Програмата прекинува кога
ќе се внесе број со непарен број на цифри.
 Пр. 2343
 Прв број: 23, 2*3 = 6
 Втор број: 43, 4*3 = 12
 Конечен број: 6+12=18*/
#include<stdio.h>
int main()
{
    int n, x, bc=0;
    printf("kolku broevi kje vneses ");
    scanf("%d", &n);
    for ( int i=0; i<n; i++)
    {
        printf("vnesi broj ");
        scanf("%d", &x);
        int a=x;
            while ( a!=0 )
            {
                bc++;
                a/=10;
            }
            if (bc % 2 != 0) 
            {
                printf("Бројот има непарен број на цифри. Програмата завршува.\n");
                break;
            }
        int d=1;
        for ( int j=0; j<bc/2; j++)
        {
            d*=10;
        }
        int x1=x/d;
        int x2=x%d;
        int s=0, s1=1, s2=1;
        while ( x1!=0 )
        {
            s1=s1*(x1%10);
            x1/=10;
        }
        while ( x2!=0 )
        {
            s2=s2*(x2%10);
            x2/=10;
        }
        s=s1+s2;
        printf("s=%d\n", s);
    }
    return 0;
}