/*Да се напише програма за закажување на третман во салон за
убавина. Корисникот прво треба да внесе колку пари има на
располагање, а потоа програмата треба, врз основа на
табелата дадена подолу, да пресмета каков третман може да
добие корисникот (според тоа колку пари има). Програмата
треба прво да провери дали има вкупно пари да гo купи
задолжителниот подтретман. Доколку има, тогаш се печати
порака дека може да се закаже третман, инаку, се печати дека
не може да се закаже третман.

Доколку може да се закаже третман, проверува дали има пари за сауна и/или третман натело. 
Доколку има пари само за сауна, тогаш се печати дека
третманот ќе содржи сауна, или доколку има пари за третман
на тело, тогаш се печати дека третманот ќе содржи и третман
на тело (ако има пари за било кое од двете незадолжителни
ставки, но нема истовремено за двете тогаш да го одбере
поскапиот подтретман). Доколку има пари и за двата
незадолжителни подтретмани, тогаш се печати дека
третманот ќе биде комплетен.*/
#include <stdio.h>
int main ()
{
    int budzet;
    int z=1000, s=500, t=1000;
    printf("kolku e vashiot budzet?");
    scanf("%d", &budzet);
    if ( budzet>=z )
    {
        printf("moze da se zakaze tretman");
    }
    else 
    {
        printf("ne mozhe da se zakaze tretman");
        return 0;
    }
    budzet-=z;
    if ( budzet >= s+t)
    {
        printf("moze da se izvrshat site tretmani");
        return 0;
    }
    else if (budzet<s+t && budzet>=t)
    {
        printf("+tretman za telo");
    }
    else if ( budzet>=s)
    {
        printf("+sauna");
    }
    else 
    {
        printf("\nmoze da se izvrshi samo zadolzitelniot tretman");
    }
    return 0;
}