/* Од тастатура се внесува број со парен број на цифри. Потоа внесениот број треба
да се подели на 2 броја. Првиот број ќе биде формиран од вредностите на парните
цифри на внесениот број прочитани во обратен редослед (од десно кон лево).
Вториот број ќе биде формиран од вредностите на непарните цифри на внесениот
број прочитани во обратен редослед (од десно кон лево). Броевите да се испечатат.
Потоа треба да се пресмета производот на цифрите од првиот број. Треба да се
пресмета и производот на цифрите од вториот број. Конечниот резултат е збирот
од производот на цифрите од првиот број и производот на цифрите од вториот
број. Да се испечати конечниот резултат. Доколку внесениот број има непарен број
на цифри на екран да се печати "GRESKA" и да се прекине програмата.
 Пример:
 Внесен број: 122556
 Прв број: 622
 Втор број: 551
 Производ од цифри на прв број: 6*2*2=24
 Производ од цифри на втор број: 5*5*1=25
 Конечен резултат: 24+25=49*/
#include<stdio.h>
int main ()
{
    int n, bc=0, bp=0, bn=0;
    printf("vnesi broj ");
    scanf("%d", &n);
    int a=n;
    while ( a!=0 )
    {
        bc++;
        a/=10;
    }
    if ( bc%2!=0)
    {
        printf("vnesen e broj so neparen broj na cifri");
        return 0;
    }
    a=n;
    while ( a!=0 )
    {
        int cifra=a%10;
        if ( cifra%2==0 )
            bp=bp*10+cifra;
        else 
            bn=bn*10+cifra;
        a/=10;
    }
    printf("obratniot broj so parni cifri e %d, a neparni %d", bp, bn);
    int sp=1, sn=1;
    while ( bp!=0 )
    {
        sp*=(bp%10);
        bp/=10;
    }
    while ( bn!=0 )
    {
        sn*=(bn%10);
        bn/=10;
    }
    int s=sn+sp;
    printf("\ns=%d", s);
    return 0;
}