/*Да се напише функција која како аргумент добива природен број.
Функцијата треба да провери дали секој пар соседни цифри во бројот
го исполнуваат условот: “Ако на цифрата со помала тежина (односно
десната цифра) се додаде 1, тогаш таа ќе биде делива (без остаток) со
соседната цифра со поголема тежина (односно левата цифра).”
Функцијата треба да врати вредност 1 ако бројот го исполнува
условот за секој пар цифри. Во случај доколку барем еден пар цифри
не го исполнуваат условот, функцијата треба да врати вредност 0. Да
се напише и главна програма која ќе ја тестира работата на
функцијата. Да се напише и рекурзивна верзија од функцијата.
 Пример: 1. За f(1235) -> функцијата треба да врати 1, бидејќи: за
цифрата 5 имаме 5 + 1 = 6 и 6 е деливо со три, за цифрата 3 имаме 3 + 1
= 4 и 4 е деливо со два, за цифрата 2 имаме 2 + 1 = 3 и 3 е деливо со 1.
2.
 За f(1237) -> функцијата треба да врати 0, бидејќи: за цифрата 7 имаме
7 + 1 = 8 и 8 не е деливо со три, останатите цифри може и не мора да
се проверуваат (бидејќи секако имаме еден пар кој не го исполнува
условот)*/
#include<stdio.h>
int funkcija(int a);
int main ()
{
    int n, f;
    printf("vnesi broj ");
    scanf("%d", &n);
    f=funkcija(n);
    printf("f=", funkcija(n));
    return 0;
}
int funkcija(int a)
{
    int i=a, cifra1, cifra2, d=0;
    while ( i!=0 )
    {
        cifra1=i%10;
        i/=10;
        cifra2=i%10;
        if ((cifra1 + 1) % cifra2 != 0)
        {
            return 0; 
        }
        else 
        {
            return 1;
        }
    }
}