/*Да се напише главна програма која што е дозволи внесување на елементите на една
матрица со димензии NxM не повеќе од 100х100) од тастатура. Вредностите на N и M исто
така се внесуваат од тастатура. Потоа, програмата треба да ја пресмета средната вредност
на елементите од целата матрица и да ги отпечати на екран оние елементи кои што се
поголеми од средната вредност на елементите на матрицата. Исто така да се отпечати
колку елементи го исполнуваат тој услов.*/
#include <stdio.h>
int main ()
{
    int n, m, j, i;
    printf("n=");
    scanf("%d", &n);
    printf("m=");
    scanf("%d", &m);
    if ( n>100 || m>100 )
    {
        printf("ne");
        return 0;
    }
    int a[n][m], brojac=0;
    float s=0;
    printf("vnesi ja matricata ");
    for ( i=0; i<n; i++ )
    {
        for ( j=0; j<m; j++) {
        scanf("%d", &a[i][j]);
        s+=a[i][j];
    }}
    s/=(n*m);
    printf("s=%.2f \n", s);
    printf("el: ");
    for ( i=0; i<n; i++ )
    {
        for ( j=0; j<m; j++) {
            if ( a[i][j] > s ) {
            printf("%d ", a[i][j]);
            brojac++;}
    }}
    printf("\n %d el", brojac);
    return 0;
}