/*Да се напише рекурзивна функција која ќе го пресметува бројот на посетители во
Македонскиот античкиот музеј во Струга (отворен во 2028 година како резултат на
низа археолошки епохални откритија со богато културно, уметничко, историско и 
национално значење од архајскиот период во близина на Струга (с. Корошишта)) во
дадена година, ако знаеме дека во годината на отварање на музејот во Струга, бројот
на посетители бил 750 000, а според следени статистики, тој број се зголемува за една
петтина од бројот во секоја претходна година.
Да се напише главна програма во која ќе се повика функцијата.
Пример:
Ако некој бројот на посетители во 2028 година изнесува 750 000, во 2033 година тој
број изнесува 1866240, односно со влез (750000,2033) функцијата дава излез 1866240.*/

#include <stdio.h>
int funkcija (int n, int p)
{
    if ( n==2028 ) return p;
    else return funkcija (n-1, p*1.2);
}
int main ()
{
    int godina, p=750000;
    printf("vnesi ja godinata ");
    scanf("%d", &godina);
    if ( godina<2028 )
    {
        printf("godinata mora da bide 2028 ili podocna");
        return 0;
    }
    printf("brojot na posetiteli vo %d iznesuva %d", godina, funkcija(godina, p));
    return 0;
}
