/*Да се напише програма која како аргумент од командна линија прима име на влезна
датотека во која се сместени броеви на мобилни телефони, по еден број во ред. Програмата
треба да ги запише броевите на мобилните телефони во излезна датотека, чие име исто така се
задава како аргумент од командна линија. Дополнително после секој број, треба да се запишат
цифрите од истиот, но со зборови, одделени со тире (-). Да се провери дали правилно се
користи програмата, ако не, да се даде упатство за користење.
Пример за валидни аргументи внесени од командна линија:: ./a.out p1.txt p2.txt
Пример:
Влезна датотека: Излезна датотека:
070123456 070123456-nula-sedum-nula-eden-dva-tri-cetiri-pet-sest
072233456 072233456-nula-sedum-dva-dva-tri-tri-cetiri-pet-sest */
#include <stdio.h>
int main (int argc, char *arvg[])
{

    return 0;
}

//neam chepnato datoteki