/*Да се напише програма која како аргументи добива
матрица од цели броеви и димензии на матрицата преку
тастатура. Програмата треба да ја подреди матрицата
според редиците,редица по редица, така што најпрвин ќе
дојдат парните броеви од редицата која што се
разгледува, а потоа непарните броеви (притоа да не се
подредуваат според индексот на елементот, туку само по
тоа дали е вредноста на елементот е парна или непарна).
Да се земе во предвид дека 0 е парен број. На крај
програмата треба да ја отпечати матрицата на екран по
трансформацијата.*/
#include <stdio.h>
int main ()
{
    int n, m, i, j;
    printf("n, m"); scanf("%d %d", &n, &m);
    int a[n][m];
    printf("el: ");
    for (i=0; i<n; i++)
    for (j=0; j<m; j++)
    scanf("%d", &a[i][j]);
    int b[n][m];
    for (i=0; i<n; i++)
    {
        int t=0, k=0;
        for(j=0; j<m; j++)
        {
        if (a[i][j]%2==0)
        {
            b[i][k]=a[i][j]; k++;
        }
        else
        {
            b[i][m-1-t]=a[i][j]; t++;
        }
        }
    }
    for (i=0; i<n; i++)
    for (j=0; j<m; j++)
    printf("%d ", b[i][j]);
    return 0;
}