/*◼ Да се напише рекурзивна функција која како аргумент добива повеќе
цифрен број и една буква. Функцијата треба на екран да ја отпечати
буквата што се добива кога на внесената буква се додава цифрата од
бројот. Најпрво да се почне од најлевата цифра, па потоа од таа пред неа
и т.н.*/
#include <stdio.h>
void fja(int n, char c);
int main ()
{
    int a;
    printf("a=");
    scanf("%d", &a);
    fja(a, 'A');
    return 0;
}
void fja (int n, char c)
{
    if ( n/10==0 )
        printf ("%c", n+c);
    else 
    {
        fja ( n/10, c);
        printf("%c", n%10+c);
    }
}