/*Да се напише рекурзивна функција која ќе добие како аргументи два цели
броеви и ќе изврши собирање на цифрите на двата броеви на иста позиција
и ќе креира нов број. Доколку сумата на цифрите од двата броеви
надминува 9, во новиот број се запишува 1, инаку се запишува 0.
Рекурзијата се извршува додека има цифри во барем еден од двата броеви.*/
#include <stdio.h>
int s (int a, int b);
int main ()
{
    int n;
    n=s(6728,5678);
    printf("%d", n);
    return 0;
}
int s (int a, int b)
{
    if ( a%10==0 || b%10==0 )
        return ((a%10+b%10)>9);
    else 
        return s(a/10, b/10)*10+((a%10+b%10)>9);
}