#include <stdio.h> // ne mi e sigurna dal e okej me mrzi da ja proveruem
/*Да се напише програма која внесува матрица А од цели броеви и димензии на
матрицата преку тастатура. Програмата треба да провери дали матрицата е
квадратна, доколку не е, да се испише порака за грешка на екран и програмата
завршува со извршување.
 Потоа, збирот од елементите под главната дијагонала од матрицата А да се смести
во променлива W, a производот од елементите на споредната дијагонала од
матрицата А да се смести во променлива Q.
 Да се креира нова матрица B на следниот начин така што сите елементи од главната
дијагонала во матрицата B треба да имаат вредност W, a сите останати елементи од
матрицата B треба да имаат вредност од разликата на променливата Q со вредноста
од елементот на соодветната позиција. На крајот новата матрица B и
променливите W и Q да се испечатат на екран.*/
int main()
{
    int m,n,i,j,w=0;
    print("Vnesi dim na matricata");
    scanf("%d %d", &n,&m);
    int a[n][m];
    for(i=0;i<n;i++)
    {
        for(j=0;j<m;j++)
        {
            scanf("%d", &a[i][j]);
        }
    }
    if(n!=m)
    printf("vnesenata matrica ne e kvadratna");
    else
    for(i=0;i<n;i++)
    {
        for(j=0;j<m;j++)
        {
            if(i>j)
            
        }
    }
    
    return 0;
} //nedoreshena