/*Да се напише програма во која ќе се дозволат внесување на
димензии M x M и вредности на матрица А од тастатура. Нека X e
збирот од елементите под главната дијагонала во матрицата А.
Нека Y е збирот од елементите под споредната дијагонала во              a[0][2]     a[i][n-j-1]
матрицата А. Да се креира нова матрица B на следниот начин така што
сите елементи од главната дијагонала во матрицата B треба да имаат
вредност X, сите елементи од споредната дијагонала во матрицата B
треба да имаат вредност Y. Доколку даден елемент припаѓа и на
главната и на споредната дијагонала во матрицата B, тогаш неговата
вредност e 1, а за сите останати елементи во матрицата B да имаат
вредност 0. Новата матрица B да се испечати на екран.

    2 3 3   X=6          6 0 5
A = 3 1 2   Y=5      B = 0 1 0
    2 1 2                5 0 6
*/
#include <stdio.h>
int main ()
{
    int i, j, n, x=0, y=0;
    printf("vnesi gi dimenziite na matricata: ");
    scanf("%d", &n);
    int a[n][n]; int b[n][n];
    printf("vnesi gi elementite na matricata: ");
    for (i=0; i<n; i++)
    for (j=0; j<n; j++)
    {
    scanf("%d", &a[i][j]);
    b[i][j]=0;
    }
    for (i=1; i<n; i++)
    {
        for (j=0; j<i; j++) {
        x+=a[i][j];
        y+=a[i][n-j-1]; }
    }
    for (i=0; i<n; i++)
    {
        b[i][i]=x;
        b[i][n-i-1]=y;
        if (i == n - i - 1) {
            b[i][i] = 1;
        }
    }
    printf("novata matrica e ");
    for (i=0; i<n; i++)
    for (j=0; j<n; j++)
    printf("%d ", b[i][j]);
    return 0;
}