/*Да се напише програма во која ќе се внесе должина на низа од тастатура, а потоа ќе
се внесат и елементите на низата. Дополнително од тастатура се внесува и
природен број h, кој треба да биде помал од должината на низата. Ако бројот h е
поголем од доделената должина, програмата треба да отпечати порака за грешка и
да заврши. Ако внесениот број h е помал или еднаков на доделената должина,
тогаш во низата треба да се пронајдат сите поднизи од последователни елементи
со должина h. За секоја од поднизите треба да се направи проверка дали го
содржат бројот h. Програмата треба да ги отпечати оние поднизи кои го содржат
тој број. Ако не постои таква подниза, програмата појавува порака за грешка и
завршува.
 niza = [4, 15, 1, 42, 52, 5, 39, 2, 18, 87, 91]
 За внесен број h = 5, се разгледуваат поднизите: [4, 15, 1, 42, 52], [15, 1, 42, 52, 5], [1,
42, 52, 5, 39], [42, 52, 5, 39, 2], [52, 5, 39, 2, 18], [5, 39, 2, 18, 87], [39, 2, 18, 87, 91].
 Програмата треба да ги испечати оние низи кои во случајот го содржат бројот 5.
Тие низи се: [15, 1, 42, 52, 5], [1, 42, 52, 5, 39], [42, 52, 5, 39, 2], [52, 5, 39, 2, 18], [5, 39,2, 18, 87].*/
#include <stdio.h>
int main ()
{
    int n, h;
    printf("vnesi dolz");
    scanf("%d", &n);
    int a[n];
    printf("vnesi h: ");
    scanf("%d", &h);
    if (h>n)
    {
        printf("greshka");
        return 0;
    }
    int *p=a;
    while (*p)
    {
        for (int i=0; i<=h; i++)
        {
            
        }
        p++;
    }
    return 0;
}//nbt 